

var app = new Vue({

  el: '#app',
  tel:"",
  name:"",
  methods: {

    hello: function () {
      alert("訂購成功 !"+"\r\r連絡電話 : "+app.tel+"\r聯絡姓名 : "+
      app.name+"\r\r已訂購項目 : "+app.select+"\r\r\r稍後回電與您做最後確認 !"
      
      )
      
    }

  },
  data: {


    hakka: [
      '客家茄子',
      '苦瓜鹹蛋',
      '豆豉苦瓜',
      '蔥燒豆腐',
      '客家小炒',
      '薑絲大腸',
      '梅干扣肉',
    ],
    colddish: [
      '涼拌肚王',
      '涼拌毛肚',
      '涼拌肚片',
      '涼拌牛筋',
      '香辣三絲'
    ],
    soup: [
      '牛雜湯',
      '毛肚湯',
      '牛心湯',
      '牛肝湯',
      '紅燒牛肉湯',
      '酸菜鴨肉湯'
    ],
    hotpot: [
      '番茄牛尾鍋',
      '東兜料砂鍋',
      '砂鍋魚頭',
      '慢燉四物雞',
      '藥燉排骨'
    ],
    maindish: [
      '白飯',
      '油蔥飯',
      '牛肉炒飯',
      '牛肉炒麵',
      '什錦炒麵',

    ],
    porridge: [
      '牛肉蔬菜粥',
      '豬肝粥',
      '海鮮粥',
      '紅蟳粥',
      '香菇雞蓉粥'

    ],
    select: [],

  }
})







